ERP.belugaerp/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Проекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_КодНСИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_МетодГруппировкиВКПК</name>
    <type>
      <types>EnumRef.бг_МетодГруппировкиВКПК</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПорядокВывода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/Проекты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_КодНСИ",
		Элементы.ГруппаДополнительныеРеквизиты,
		"Объект.бг_КодНСИ");
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_ПорядокВывода",
		Элементы.ГруппаДополнительныеРеквизиты,
		"Объект.бг_ПорядокВывода");
	
	Элемент = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьПолеНаФорму(
		ЭтотОбъект,
		"бг_МетодГруппировкиВКПК",
		Элементы.ГруппаДополнительныеРеквизиты,
		"Объект.бг_МетодГруппировкиВКПК");
	
КонецПроцедуры

#КонецОбласти
